# #Необходимо написать программу, которая требует у
# пользователя ввести два целых числа, строку и одно дробное
# число, далее выводит на экран строку и сумму двух целых и
# дробного числа


a = int(input('Введите число а: '))
b = int(input('Введите число b: '))
c = input('Введите строку :')
d = float(input('Введите число d :'))
print(a + b + d, c)
