# Задача:
# Запросить у пользователя имя, фамилию, отчество, возраст
# и город проживания.Вывести на экран ФИО в одну строку
# Возраст и город в отдельных.
a = input('Введите Имя :')
b = input('Введите фамилию :')
c = input('Введите Отчество :')
d = int(input('Введите возраст :'))
e = input('Введите город проживания :')
print(b, a, c)
print(d)
print(e)
